ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/C29/f29h85x_ssu_cpu3_ap_regs.xml
<module id="SSU_CPU3_AP_REGS" HW_revision="" description="SSU CPU3 AP Registers">
	<group id="SSU_CPU3_AP_REGS_RegisterFile0" name="SSU_CPU3_AP_REGS_RegisterFile0" instances="64" offset="0x0" instaddr="32">
		<register id="AP_CFG" width="32" page="0" offset="0x0" instances="1" instaddr="4" internal="0" description="Access Protection  Configuration">
			<bitfield id="LINKID" description="LINK ID Value" begin="3" end="0" width="4" rwaccess="RW"/>
			<bitfield id="APD" description="Access Protection Disable" begin="6" end="6" width="1" rwaccess="RW"/>
			<bitfield id="XE" description="Execute Enable" begin="7" end="7" width="1" rwaccess="RW"/>
			<bitfield id="APILINK" description="Access Protection Inheritance LINK" begin="11" end="8" width="4" rwaccess="RW"/>
			<bitfield id="APILINKE" description="Access Protection Inheritance LINK Enable" begin="14" end="14" width="1" rwaccess="RW"/>
		</register>
		<register id="AP_START" width="32" page="0" offset="0x4" instances="1" instaddr="4" internal="0" description="Access Protection  Start Address">
		</register>
		<register id="AP_END" width="32" page="0" offset="0x8" instances="1" instaddr="4" internal="0" description="Access Protection  End Address">
		</register>
		<register id="AP_LOCK" width="32" page="0" offset="0xc" instances="1" instaddr="4" internal="0" description="Access Protection  Temporary Lock">
			<bitfield id="LOCK" description="Temporary Lock" begin="0" end="0" width="1" rwaccess="RW"/>
		</register>
		<register id="AP_COMMIT" width="32" page="0" offset="0x10" instances="1" instaddr="4" internal="0" description="Access Protection  Permanent Commit">
			<bitfield id="COMMIT" description="Permanent Commit" begin="0" end="0" width="1" rwaccess="RW"/>
		</register>
		<register id="AP_ACCESS" width="32" page="0" offset="0x14" instances="1" instaddr="4" internal="0" description="Access Protection  R/W Access Permissions">
			<bitfield id="LINK0" description="LINK0 Access Permissions" begin="1" end="0" width="2" rwaccess="RW"/>
			<bitfield id="LINK1" description="LINK1 Access Permissions" begin="3" end="2" width="2" rwaccess="RW"/>
			<bitfield id="LINK2" description="LINK2 Access Permissions" begin="5" end="4" width="2" rwaccess="RW"/>
			<bitfield id="LINK3" description="LINK3 Access Permissions" begin="7" end="6" width="2" rwaccess="RW"/>
			<bitfield id="LINK4" description="LINK4 Access Permissions" begin="9" end="8" width="2" rwaccess="RW"/>
			<bitfield id="LINK5" description="LINK5 Access Permissions" begin="11" end="10" width="2" rwaccess="RW"/>
			<bitfield id="LINK6" description="LINK6 Access Permissions" begin="13" end="12" width="2" rwaccess="RW"/>
			<bitfield id="LINK7" description="LINK7 Access Permissions" begin="15" end="14" width="2" rwaccess="RW"/>
			<bitfield id="LINK8" description="LINK8 Access Permissions" begin="17" end="16" width="2" rwaccess="RW"/>
			<bitfield id="LINK9" description="LINK9 Access Permissions" begin="19" end="18" width="2" rwaccess="RW"/>
			<bitfield id="LINK10" description="LINK10 Access Permissions" begin="21" end="20" width="2" rwaccess="RW"/>
			<bitfield id="LINK11" description="LINK11 Access Permissions" begin="23" end="22" width="2" rwaccess="RW"/>
			<bitfield id="LINK12" description="LINK12 Access Permissions" begin="25" end="24" width="2" rwaccess="RW"/>
			<bitfield id="LINK13" description="LINK13 Access Permissions" begin="27" end="26" width="2" rwaccess="RW"/>
			<bitfield id="LINK14" description="LINK14 Access Permissions" begin="29" end="28" width="2" rwaccess="RW"/>
			<bitfield id="LINK15" description="LINK15 Access Permissions" begin="31" end="30" width="2" rwaccess="RW"/>
		</register>
	</group>
</module>
